# Cancel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AppearanceAssetEditScope..::..Cancel Method
AppearanceAssetEditScope Class See Also
---
Cancels the edit scope.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public void Cancel()
```

Visual Basic
---
```text
Public Sub Cancel
```

Visual C++
---
```text
public:
void Cancel()
```

# Remarks
All the changes made after starting the EditScope will be discarded.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | EditScope is not active. EditScope can only be committed or cancelled when it is active. -or- EditScope cannot be closed, there is no opened transaction. |

# See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace